Revit 2017 API
AssetType Enumeration
An enumerated to list Asset Types in Revit.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public enum AssetType
Visual Basic
Public Enumeration AssetType
Visual C++
public enum class AssetType
Members
Member name | Description
Appearance |  Appearance assets (materials).
Content |  Content assets (RPC / entourage).
See Also
Autodesk.Revit.Utility Namespace